//
//  MarketDataModel.swift
//  SwiftfulCrypto2
//
//  Created by 우주형 on 2023/03/06.
//

import Foundation
// JSON Data:
/*
URL: https://api.coingecko.com/api/v3/global

JSON Response:
 {
   "data": {
     "active_cryptocurrencies": 12301,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 670,
     "total_market_cap": {
       "btc": 47811478.25405015,
       "eth": 683643691.1044624,
       "ltc": 12230604658.480312,
       "bch": 8668542306.726751,
       "bnb": 3753326925.6329665,
       "eos": 884942500985.6991,
       "xrp": 2934937409765.853,
       "xlm": 12962594607228.408,
       "link": 155214538293.95792,
       "dot": 180061414609.7352,
       "yfi": 105822882.31520997,
       "usd": 1071795953350.6198,
       "aed": 3936540408284.0566,
       "ars": 213720165558613.1,
       "aud": 1590136840514.0955,
       "bdt": 112467563260925.73,
       "bhd": 404072433392.95,
       "bmd": 1071795953350.6198,
       "brl": 5582556402622.021,
       "cad": 1458338092130.5693,
       "chf": 1000237496525.166,
       "clp": 863653179209930.8,
       "cny": 7432476218105.227,
       "czk": 23674168776925.688,
       "dkk": 7486504380317.643,
       "eur": 1005999471570.3771,
       "gbp": 891042924797.8044,
       "hkd": 8413416028490.272,
       "huf": 379457543948789,
       "idr": 16422351406519292,
       "ils": 3853822411992.3145,
       "inr": 87682936707020.27,
       "jpy": 145517377116768.97,
       "krw": 1390643524024698.2,
       "kwd": 328923460123.77185,
       "lkr": 363137683167499,
       "mmk": 2250565842613385,
       "mxn": 19273725069744.797,
       "myr": 4797358687197.354,
       "ngn": 493466376585531.2,
       "nok": 11180403046314.598,
       "nzd": 1728759713732.6023,
       "php": 58980925953904.83,
       "pkr": 293541019147342.6,
       "pln": 4736821508160.225,
       "rub": 80852009183121.06,
       "sar": 4022766392731.1113,
       "sek": 11228089391871.047,
       "sgd": 1441612716278.5283,
       "thb": 36980711676433.11,
       "try": 20258974571658.31,
       "twd": 32826431633042.08,
       "uah": 39578435318324.484,
       "vef": 107318928808.99776,
       "vnd": 25364958667799124,
       "zar": 19506237268476.81,
       "xdr": 805812638791.4094,
       "xag": 50580280374.19858,
       "xau": 578373250.306595,
       "bits": 47811478254050.15,
       "sats": 4781147825405015
     },
     "total_volume": {
       "btc": 1752969.8304075191,
       "eth": 25065252.299599037,
       "ltc": 448425394.00340456,
       "bch": 317825210.43502676,
       "bnb": 137612747.07571805,
       "eos": 32445713090.70321,
       "xrp": 107607146261.32912,
       "xlm": 475263223394.47253,
       "link": 5690817619.655844,
       "dot": 6601808581.491144,
       "yfi": 3879911.8295325716,
       "usd": 39296546335.44706,
       "aed": 144330123725.41504,
       "ars": 7835879919529.835,
       "aud": 58301102777.64971,
       "bdt": 4123533772544.4824,
       "bhd": 14814994451.195204,
       "bmd": 39296546335.44706,
       "brl": 204679991242.80893,
       "cad": 53468806474.77978,
       "chf": 36672912419.360954,
       "clp": 31665157037103.29,
       "cny": 272505830217.79187,
       "czk": 867994572462.5425,
       "dkk": 274486729822.01413,
       "eur": 36884170652.46024,
       "gbp": 32669380278.70559,
       "hkd": 308471208320.38153,
       "huf": 13912509103531.318,
       "idr": 602112455235373.6,
       "ils": 141297334168.8842,
       "inr": 3214825148727.085,
       "jpy": 5335278916294.977,
       "krw": 50986838966025.61,
       "kwd": 12059717104.885353,
       "lkr": 13314154385569.238,
       "mmk": 82515206965238.36,
       "mxn": 706655803179.8488,
       "myr": 175891341397.4603,
       "ngn": 18092552292119.812,
       "nok": 409920587015.64136,
       "nzd": 63383600191.03735,
       "php": 2162488748356.9197,
       "pkr": 10762448042668.04,
       "pln": 173671793867.34235,
       "rub": 2964374623029.706,
       "sar": 147491530878.10165,
       "sek": 411668968955.19714,
       "sgd": 52855583869.21495,
       "thb": 1355868386485.0977,
       "try": 742779192695.2549,
       "twd": 1203555012185.4517,
       "uah": 1451111858100.33,
       "vef": 3934763184.5683217,
       "vnd": 929986039292122.9,
       "zar": 715180678052.2213,
       "xdr": 29544479617.564487,
       "xag": 1854485758.3861196,
       "xau": 21205595.298997298,
       "bits": 1752969830407.519,
       "sats": 175296983040751.9
     },
     "market_cap_percentage": {
       "btc": 40.38759442907885,
       "eth": 17.616709548612306,
       "usdt": 6.675234960115055,
       "bnb": 4.200236376340565,
       "usdc": 4.100936968716768,
       "xrp": 1.735443710669756,
       "okb": 1.1028029178941798,
       "ada": 1.0874393248610237,
       "doge": 0.9589987566867577,
       "matic": 0.9489802631617621
     },
     "market_cap_change_percentage_24h_usd": -0.43413067636775204,
     "updated_at": 1678109402
   }
 }

*/

struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double
    
    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    var marketCap: String {
        if let item = totalMarketCap.first(where: {$0.key == "usd"}) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volume: String {
        if let item = totalVolume.first(where: { $0.key == "usd"}) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc"}) {
            return item.value.asPercentString()
        }
        return ""
    }
}
